FSAndDisk_Test/FS_Disk_SSD_MP400_4TB_NVMe_scripts/mp4004TB_fs_fio_test_read_ranseq/seq_read_block_64k_32_4_jobs.out
seq_read_test: (g=0): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=32
...
fio-3.28
Starting 4 processes

seq_read_test: (groupid=0, jobs=4): err= 0: pid=1841201: Mon May 13 16:12:04 2024
  read: IOPS=49.5k, BW=3093MiB/s (3244MB/s)(200GiB/66208msec)
    slat (usec): min=4, max=945, avg=20.66, stdev= 5.94
    clat (usec): min=1382, max=11392, avg=2563.83, stdev=312.91
     lat (usec): min=1405, max=11456, avg=2584.70, stdev=313.05
    clat percentiles (usec):
     |  1.00th=[ 2114],  5.00th=[ 2180], 10.00th=[ 2245], 20.00th=[ 2311],
     | 30.00th=[ 2376], 40.00th=[ 2442], 50.00th=[ 2507], 60.00th=[ 2573],
     | 70.00th=[ 2671], 80.00th=[ 2802], 90.00th=[ 2966], 95.00th=[ 3130],
     | 99.00th=[ 3589], 99.50th=[ 3785], 99.90th=[ 4146], 99.95th=[ 4293],
     | 99.99th=[ 4621]
   bw (  MiB/s): min= 2991, max= 3255, per=100.00%, avg=3097.28, stdev=14.09, samples=528
   iops        : min=47866, max=52094, avg=49556.44, stdev=225.50, samples=528
  lat (msec)   : 2=0.07%, 4=99.72%, 10=0.20%, 20=0.01%
  cpu          : usr=8.26%, sys=29.71%, ctx=1761221, majf=0, minf=2131
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=3276800,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=3093MiB/s (3244MB/s), 3093MiB/s-3093MiB/s (3244MB/s-3244MB/s), io=200GiB (215GB), run=66208-66208msec

Disk stats (read/write):
  nvme4n1: ios=3271478/0, merge=0/0, ticks=8323360/0, in_queue=8323361, util=99.97%

Test Time: 2024-05-13 16:12:04
Device Name: filetest.txt
Device Info: